иб/src/Documents/НазначениеОтветственных/НазначениеОтветственных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеОтветственных</name>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сектор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственныеПоСкладам</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

иб/src/Documents/НазначениеОтветственных/Forms/ФормаДокументаУпр/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
	// Первоначальное заполнение нового объекта
	если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ОбщегоНазначенияСервер.ПервоначальноеЗаполнениеДокумента(ДокОбъект);
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	КонецЕсли;
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура ("Ферма", Объект.Ферма));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеПоКорпусу(Команда)
	
	если НЕ ЗначениеЗаполнено(Объект.Корпус) тогда
		ОбщегоНазначенияСервер.СообщитьПользователю("Поле ""Корпус"" не заполнено",, "Корпус", "Объект");
		Возврат;
	КонецЕсли;
		
	если НЕ Объект.Ответственные.Количество() = 0 тогда
		ТекстВопроса = "При выполнении операции строки табличной части будут удалены! Продолжить?";
		Ответ = Вопрос (ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		иначе
			Объект.Ответственные.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьВсеПоКорпусуСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеПоКорпусуСервер ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сектора.Ссылка КАК Сектор,
	               |	ЕСТЬNULL(ОтветственныеСрезПоследних.Ответственный.Ссылка, ЗНАЧЕНИЕ(Справочник.сжсвСотрудники.ПустаяСсылка)) КАК Ответственный
	               |ИЗ
	               |	Справочник.сжсвСектора КАК Сектора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сжсвОтветственные.СрезПоследних(&Дата, ) КАК ОтветственныеСрезПоследних
	               |		ПО Сектора.Ссылка = ОтветственныеСрезПоследних.ОбъектОтветственности
	               |ГДЕ
	               |	Сектора.Владелец = &Корпус";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, КонецДня (Объект.Дата)));
	Запрос.УстановитьПараметр("Корпус", Объект.Корпус);
	Результат = Запрос.Выполнить();
	если НЕ Результат.Пустой() тогда
		Объект.Ответственные.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвободныеПоКорпусу(Команда)
	
	если НЕ ЗначениеЗаполнено(Объект.Корпус) тогда
		ОбщегоНазначенияСервер.СообщитьПользователю("Поле ""Корпус"" не заполнено",, "Корпус", "Объект");
		Возврат;
	КонецЕсли;
		
	если НЕ Объект.Ответственные.Количество() = 0 тогда
		ТекстВопроса = "При выполнении операции строки табличной части будут удалены! Продолжить?";
		Ответ = Вопрос (ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		иначе
			Объект.Ответственные.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСвободныеПоКорпусуСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвободныеПоКорпусуСервер ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сектора.Ссылка КАК Сектор,
	               |	ЕСТЬNULL(ОтветственныеСрезПоследних.Ответственный.Ссылка, ЗНАЧЕНИЕ(Справочник.сжсвСотрудники.ПустаяСсылка)) КАК Ответственный
	               |ИЗ
	               |	Справочник.сжсвСектора КАК Сектора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сжсвОтветственные.СрезПоследних(&Дата, ) КАК ОтветственныеСрезПоследних
	               |		ПО Сектора.Ссылка = ОтветственныеСрезПоследних.ОбъектОтветственности
	               |ГДЕ
	               |	Сектора.Владелец = &Корпус
	               |	И ОтветственныеСрезПоследних.Ответственный ЕСТЬ NULL ";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, КонецДня (Объект.Дата)));
	Запрос.УстановитьПараметр("Корпус", Объект.Корпус);
	Результат = Запрос.Выполнить();
	если НЕ Результат.Пустой() тогда
		Объект.Ответственные.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеПоФерме(Команда)
	
	если НЕ ЗначениеЗаполнено(Объект.Ферма) тогда
		ОбщегоНазначенияСервер.СообщитьПользователю("Поле ""Ферма"" не заполнено",, "Ферма", "Объект");
		Возврат;
	КонецЕсли;
		
	если НЕ Объект.ОтветственныеПоСкладам.Количество() = 0 тогда
		ТекстВопроса = "При выполнении операции строки табличной части будут удалены! Продолжить?";
		Ответ = Вопрос (ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		иначе
			Объект.ОтветственныеПоСкладам.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьВсеПоФермеСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеПоФермеСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Склад,
	               |	ЕСТЬNULL (ОтветственныеСрезПоследних.Ответственный.Ссылка, ЗНАЧЕНИЕ(Справочник.сжсвСотрудники.ПустаяСсылка)) КАК Ответственный
	               |ИЗ
	               |	Справочник.сжсвСклады КАК Склады
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сжсвОтветственные.СрезПоследних(&Дата, ) КАК ОтветственныеСрезПоследних
	               |		ПО Склады.Ссылка = ОтветственныеСрезПоследних.ОбъектОтветственности
	               |ГДЕ
	               |	Склады.Ферма = &Ферма";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, КонецДня (Объект.Дата)));
	Запрос.УстановитьПараметр("Ферма", Объект.Ферма);
	Результат = Запрос.Выполнить();
	если НЕ Результат.Пустой() тогда
		Объект.ОтветственныеПоСкладам.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвободныеПоФерме(Команда)
	
	если НЕ ЗначениеЗаполнено(Объект.Ферма) тогда
		ОбщегоНазначенияСервер.СообщитьПользователю("Поле ""Ферма"" не заполнено",, "Ферма", "Объект");
		Возврат;
	КонецЕсли;
		
	если НЕ Объект.ОтветственныеПоСкладам.Количество() = 0 тогда
		ТекстВопроса = "При выполнении операции строки табличной части будут удалены! Продолжить?";
		Ответ = Вопрос (ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		иначе
			Объект.ОтветственныеПоСкладам.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСвободныеПоФермеСервер();
	
КонецПроцедуры

Процедура ЗаполнитьСвободныеПоФермеСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Склад,
	               |	ЕСТЬNULL (ОтветственныеСрезПоследних.Ответственный.Ссылка, ЗНАЧЕНИЕ(Справочник.сжсвСотрудники.ПустаяСсылка)) КАК Ответственный
	               |ИЗ
	               |	Справочник.сжсвСклады КАК Склады
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сжсвОтветственные.СрезПоследних(&Дата, ) КАК ОтветственныеСрезПоследних
	               |		ПО Склады.Ссылка = ОтветственныеСрезПоследних.ОбъектОтветственности
	               |ГДЕ
	               |	Склады.Ферма = &Ферма
				   |	И ОтветственныеСрезПоследних.Ответственный ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, КонецДня (Объект.Дата)));
	Запрос.УстановитьПараметр("Ферма", Объект.Ферма);
	Результат = Запрос.Выполнить();
	если НЕ Результат.Пустой() тогда
		Объект.ОтветственныеПоСкладам.Загрузить(Результат.Выгрузить());
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФермаПриИзменении(Элемент)
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура ("Ферма", Объект.Ферма));
	
КонецПроцедуры

#КонецОбласти
